# #######################################################################################
# MAIN HOST CONFIGURATION
# #######################################################################################

{ ... }:

{
  imports = [
    # Результаты сканирования железа
    ./hardware-configuration.nix

    # Все базовые системные модули одной строкой
    ../../modules/core

    # Оконные менеджеры
    ../../modules/niri/default.nix
  ];

  # Версия системы (не менять без нужды)
  system.stateVersion = "25.11";
}
